<template>
  <div>
    <el-row>
      <el-col :xs="24" :sm="{span: 20, offset: 2}" :md="{span: 20, offset: 2}" :lg="{span: 16, offset: 4}" :xl="{span: 12, offset: 6}">
        <base-box type="primary" title="博客">
          <el-page-header @back="goBack" slot="box-title" style="padding-left: 15px;">
            <div slot="title" style="">
              返回列表
            </div>
            <div slot="content" style="margin-left: ; font-size: 20px;">
              博客详情
            </div>
          </el-page-header>
          <div style="padding: 0 20px;">
            <h2>{{ blog.title }}</h2>
            <div style="text-align: center;">
              <span class="el-icon-user" title="作者">：{{blog.author}}</span><span class="el-icon-time" title="发布时间">：{{ blog.time }}</span>
            </div>
            <el-divider></el-divider>
            <p style="text-indent: 36px; line-height: 1.5;">{{ blog.content }}</p>
            <el-divider content-position="right">文字来源于中国科学技术大学历史文化网</el-divider>
            <el-divider></el-divider>
            <div style="text-align: right;">
              <span v-if="blog.info">浏览：{{ blog.info.view }}</span>
              <el-badge v-if="blog.info" :value="blog.info.comment" :max="99">
                <el-button size="small">评论</el-button>
              </el-badge>
            </div>
          </div>
        </base-box>
      </el-col>
    </el-row>
  </div>
</template>

<script>

// import axios from 'axios'

export default {
  data () {
    return {
      id: this.$route.params.id,
      blog: {}
    }
  },
  created () {
    // axios.get('api/blogs').then((data) => {
    //   this.blog = data.data.data.data[this.id - 1]
    // })
    this.blog = [
      {
        id: 1,
        time: '2013-8-26',
        author: '中国科大档案馆',
        title: '中国科学技术大学的诞生与快速发展',
        content: '1958年9月20日，中国科学技术大学成立暨开学典礼在解放军政治学院大礼堂隆重举行。郭沫若作题为《继承抗大的优秀传统前进》的致辞，聂荣臻副总理作题为《把红旗插上科学的高峰》的讲话。中国人民大学校长吴玉章、北京大学副校长周培源等代表兄弟院校领导到会祝贺并讲话。聂荣臻副总理在讲话中指出：“在科学技术方面，必须大力培养新生力量，以满足国家建设的需要，创办一所新型的大学是十分必要的。这种大学和研究机构结合在一起，选拔优秀高中毕业生，给以比较严格的科学基本知识和技术操作训练，在三四年级时，让学生到相关研究机构中参加实际工作，迅速掌握业务知识，加快培养进度，以便在一段时期内使祖国最急需的、薄弱的、新兴的科学部分迅速赶上先进国家水平。中国科学技术大学就是在这样的要求下筹办的。经过很短的时间，在郭沫若院长的直接领导下进行筹备工作，一个社会主义的新型大学——中国科学技术大学诞生了。这将是写在我国教育史和科学史上的一项重大事件。”这段话勾画了党中央创办中国科学技术大学时的创新思路，也形成了中国科大50年来的办学方针和特色。次日，《人民日报》、《光明日报》均以《我国教育史和科学史上的一项重大事件》为题在显著位置报道了中国科大的诞生。',
        info: {
          view: 1958,
          comment: 100
        }
      },
      {
        id: 2,
        time: '2013-8-26',
        author: '中国科大档案馆',
        title: '中国科学技术大学建设一流大学与实施精英教育',
        content: '1998年，中国科大迎来了建校40周年。中共中央总书记、国家主席江泽民为中国科大建校40周年题词“面向二十一世纪，建设一流大学，培育一流人才”，全国人大常委会委员长李鹏题词“庆祝中国科学技术大学四十周年，为国家科教事业做出新贡献”，原全国人大常委会委员长乔石，原国务委员张劲夫，全国人大常委会副委员长周光召、彭珮云、吴阶平，全国政协副主席钱伟长、李贵鲜、朱光亚，中科院院长路甬祥、教育部部长陈至立、安徽省委书记回良玉等题词或致信祝贺。1998年底至1999年初，中国科大党政领导班子按照江泽民总书记为中国科大40周年校庆题词的要求，结合教育部面向21世纪教育振兴行动计划的实施和中国科学院知识创新工程试点工作，组织全校上下集思广益，提出了学校面向21世纪建设一流大学的发展目标：即到2018年建校60周年前后，把学校建成规模适度、质量优异、结构合理、特色鲜明的一流研究型大学，成为与中科院和其他专业研究院、所及高科技企业相结合，面向全国培养具有创新能力和现代知识结构的一流人才，具有较强知识创新和技术创新能力的教育与科研基地。同时，学校还组织力量，广泛发动师生员工，研究制定了中国科学技术大学建设世界知名的高水平大学规划。2006年12月22日，经中国科学院院长办公会议批准，《中国科学技术大学“十一五”期间建设与发展规划》正式发布实施。《规划》指出，“十一五”期间，学校将贯彻“质量优异、特色鲜明、规模适度、结构合理”和“全院办校、所系结合”的办学方针，推进一流研究型大学建设，为在2018年前后建成一流研究型大学奠定良好的基础，为我国实施科教兴国战略和实现建设创新型国家的战略目标做出积极的贡献。',
        info: {
          view: 2019,
          comment: 61
        }
      },
      {
        id: 3,
        time: '2013-8-26',
        author: '中国科大档案馆',
        title: '中国科学技术大学“三大工程”建设与体制改革',
        content: '1990年代中期以来，胡锦涛、江泽民、吴邦国、贾庆林、李长春、习近平、李鹏、李瑞环、李岚清等党和国家领导人相继视察中国科大，对学校建设与发展给予热情关怀和勉励，中国科学院、国家教委和安徽省委、省政府给予大力支持，使学校在国内外激烈竞争中，保持快速、健康、持续发展的良好态势。1988年2月，国务院任命中国科学院学部委员谷超豪为中国科大校长，调刘乃泉任党委书记。1990年4月，汤洪高任党委书记兼常务副校长。1993年7月，汤洪高任校长，余翔林任党委书记。1998年6月，国务院任命中国科学院院士朱清时任中国科大校长，汤洪高任党委书记。中国科大的领导体制由1984年以来试行校长负责制，转换为实行党委领导下的校长负责制。',
        info: {
          view: 1949,
          comment: 70
        }
      },
      {
        id: 4,
        time: '2013-8-26',
        author: '中国科大档案馆',
        title: '中国科学技术大学率先改革与重新崛起',
        content: '1976年10月“四人帮”的倒台标志着“文化大革命”的结束。在中国科大经历了迁校合肥和为生存奋斗的困难时期后，中国科学院于1977年8月5日至13日在北京召开了中国科大第一次工作会议，提出科大既要成为教学中心，又要成为科研中心，制订了一系列拨乱反正的改革措施。郭沫若校长会见了与会人员，并重新审定了校歌。8月18日，新华社以《一定要办好中国科技大学》为题，报道了中国科学院召开中国科学技术大学工作会议的消息。8月19日，《人民日报》在刊登新华社消息的编后语中称：“在教育要大上的形势下，中国科学技术大学先迈开了一大步。”9月5日，中国科学院向国务院提交《关于中国科学技术大学几个问题的报告》，提出要继续采取“全院办校，所系结合”的方针，采取措施加强中国科学技术大学的教学、科研工作，扎根安徽，把科大办成一个能够独立进行高水平教学和科研的重点大学，加强基础课教学，主要招收应届高中毕业生，在北京设立中国科大研究生院，加大基建投入，学校的思想政治工作主要由安徽省领导，业务行政主要由中国科学院负责等七条措施。中共中央主席华国锋、副主席邓小平及纪登奎、余秋里、王震、谷牧副总理等批示同意。',
        info: {
          view: 2019,
          comment: 66
        }
      }
    ][this.id - 1]
  },
  methods: {
    goBack () {
      this.$router.push({ name: 'blog' })
    }
  }
}
</script>

<style lang="scss" scoped>
h2 {
  text-align: center;
}
span {
  margin-right: 20px;
  font-size: 16px;
}
</style>
