<template>
  <div>
    <el-row>
      <el-col :xs="24" :sm="{span: 20, offset: 2}" :md="{span: 20, offset: 2}" :lg="{span: 16, offset: 4}" :xl="{span: 12, offset: 6}">
        <base-box type="primary" title="中国科学技术大学简介">
          <el-carousel height="330px">
            <el-carousel-item v-for="item in items" :key="item.name">
              <img :src="item.url" :title="item.name"/>
            </el-carousel-item>
          </el-carousel>
          <div class="text-info bar">校园风景</div>
          <div class="intro">
            <p>
              中国科学技术大学是中国科学院所属的一所以前沿科学和高新技术为主，兼有医学、特色管理和人文学科的综合性全国重点大学。
            </p>
            <p>
              1958年9月创建于北京，首任校长由郭沫若兼任。她的创办被称为“我国教育史和科学史上的一项重大事件”。建校后，中国科学
              院实施“全院办校，所系结合”的办学方针，学校紧紧围绕国家急需的新兴科技领域设置系科专业，创造性地把理科与工科即前沿
              科学与高新技术相结合，注重基础课教学，高起点、宽口径培养新兴、边缘、交叉学科的尖端科技人才，汇集了严济慈、华罗庚
              、钱学森、赵忠尧、郭永怀、赵九章、贝时璋等一批国内最有声望的科学家，建校第二年即被列为全国重点大学。
            </p>
            <p>
              1970年初，学校迁至安徽省合肥市，开始了第二次创业。1978年以后，学校锐意改革、大胆创新，在全国率先提出并实施了一
              系列具有创新精神和前瞻意识的教育改革措施，创办少年班、首建研究生院、建设国家大科学工程、面向世界开放办学等，使学
              校得以恢复并迅速发展。学校是国家首批实施“985工程”和“211工程”的大学之一，也是唯一参与国家知识创新工程的大学。长
              期以来，学校始终坚持“全院办校、所系结合”的办学方针，弘扬“红专并进，理实交融”的校风，形成了不断开拓创新的优良传统
              ，以及教学与科研相结合、理论与实践相结合的鲜明特色，培养了一大批德才兼备的高层次优秀人才。学校面向世界科学前沿领
              域和国家重大需求，凝练科学目标，开展科学研究，努力提高学术研究水平和科研创新能力与科研竞争力，取得了一批具有世界
              领先水平的原创性科技成果。在新的历史起点上，学校加快建设具有中国特色、科大风格的世界一流大学，在国家“双一流”建设
              中，入选A类世界一流大学建设高校。
            </p>
            <p>
              学校现有20个学院（含6个科教融合共建学院）、31个系，设有研究生院，以及苏州研究院、上海研究院、北京研究院、先进技
              术研究院、中国科学技术大学附属第一医院（安徽省立医院）等。有数学、物理学、力学、天文学、生物科学、化学共6个国家
              理科基础科学研究和教学人才培养基地和1个国家生命科学与技术人才培养基地，8个一级学科国家重点学科，4个二级学科国家
              重点学科，2个国家重点培育学科，18个安徽省一级学科重点学科。建有国家同步辐射实验室、合肥微尺度物质科学国家研究中
              心、火灾科学国家重点实验室、核探测与核电子学国家重点实验室、类脑智能技术与应用国家工程实验室、语音及语言信息处理
              国家工程实验室、量子信息与量子科技前沿协同创新中心、国家高性能计算中心（合肥）、安徽蒙城地球物理国家野外科学观测
              研究站等12个国家级科研机构、4个国家重点科技基础设施和55个院省部级重点科研机构。
            </p>
            <p>
              目前，全校上下正深化改革，锐意创新，以习近平新时代中国特色社会主义思想为指导，力争把学校建设成为与科研机构深度融
              合，创新人才和创新成果不断涌现，具有中国特色的世界一流大学，为实现“创寰宇学府，育天下英才”的宏伟目标而努力奋斗。
            </p>
            <el-divider content-position="right">图文来源于中国科学技术大学</el-divider>
          </div>
        </base-box>
      </el-col>
    </el-row>
  </div>
</template>

<script>
export default {
  data () {
    return {
      items: [
        {
          name: '化作春泥更护花',
          url: require('../../assets/1.jpg')
        },
        {
          name: '春光乍泄白玉兰',
          url: require('../../assets/2.jpg')
        },
        {
          name: '曲径通幽',
          url: require('../../assets/3.jpg')
        },
        {
          name: '艺术中心的紫藤',
          url: require('../../assets/4.jpg')
        },
        {
          name: '碧桃花开 孺子牛雕像',
          url: require('../../assets/5.jpg')
        }
      ]
    }
  }
}
</script>

<style lang="scss" scoped>
.el-carousel {
  width: 500px;
  margin: 20px auto;
}
.bar {
  text-align: center;
  margin: 0 auto;
}
.intro {
  padding: 0 10px;
  line-height: 1.5;
  p {
    text-indent: 36px;
  }
}
</style>
